bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32L562.svd
        <register>
          <name>DAC_CCR</name>
          <displayName>DAC_CCR</displayName>
          <description>
            DAC calibration control
            register
          </description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OTRIM1</name>
              <description>
                DAC Channel 1 offset trimming
                value
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OTRIM2</name>
              <description>
                DAC Channel 2 offset trimming
                value
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_MCR</name>
          <displayName>DAC_MCR</displayName>
          <description>DAC mode control register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MODE1</name>
              <description>
                DAC Channel 1 mode These bits can be
                written only when the DAC is disabled and not in the
                calibration mode (when bit EN1=0 and bit CEN1 =0 in
                the DAC_CR register). If EN1=1 or CEN1 =1 the write
                operation is ignored. They can be set and cleared by
                software to select the DAC Channel 1 mode: DAC
                Channel 1 in normal Mode DAC Channel 1 in sample
                &amp;amp; hold mode
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MODE2</name>
              <description>
                DAC Channel 2 mode These bits can be
                written only when the DAC is disabled and not in the
                calibration mode (when bit EN2=0 and bit CEN2 =0 in
                the DAC_CR register). If EN2=1 or CEN2 =1 the write
                operation is ignored. They can be set and cleared by
                software to select the DAC Channel 2 mode: DAC
                Channel 2 in normal Mode DAC Channel 2 in sample
                &amp;amp; hold mode
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_SHSR1</name>
          <displayName>DAC_SHSR1</displayName>
          <description>
            DAC Sample and Hold sample time register
            1
          </description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSAMPLE1</name>
              <description>
                DAC Channel 1 sample Time (only valid in
                sample &amp;amp; hold mode) These bits can be written
                when the DAC channel1 is disabled or also during
                normal operation. in the latter case, the write can
                be done only when BWSTx of DAC_SR register is low, If
                BWSTx=1, the write operation is
                ignored.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_SHSR2</name>
          <displayName>DAC_SHSR2</displayName>
          <description>
            DAC Sample and Hold sample time register
            2
          </description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSAMPLE2</name>
              <description>
                DAC Channel 2 sample Time (only valid in
                sample &amp;amp; hold mode) These bits can be written
                when the DAC channel2 is disabled or also during
                normal operation. in the latter case, the write can
                be done only when BWSTx of DAC_SR register is low, if
                BWSTx=1, the write operation is
                ignored.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_SHHR</name>
          <displayName>DAC_SHHR</displayName>
          <description>
            DAC Sample and Hold hold time
            register
          </description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010001</resetValue>
          <fields>
            <field>
              <name>THOLD1</name>
              <description>
                DAC Channel 1 hold Time (only valid in
                sample &amp;amp; hold mode) Hold time= (THOLD[9:0]) x
                T LSI
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>THOLD2</name>
              <description>
                DAC Channel 2 hold time (only valid in
                sample &amp;amp; hold mode). Hold time= (THOLD[9:0])
                x T LSI
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_SHRR</name>
          <displayName>DAC_SHRR</displayName>
          <description>
            DAC Sample and Hold refresh time
            register
          </description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010001</resetValue>
          <fields>
            <field>
              <name>TREFRESH1</name>
              <description>
                DAC Channel 1 refresh Time (only valid
                in sample &amp;amp; hold mode) Refresh time=
                (TREFRESH[7:0]) x T LSI
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TREFRESH2</name>
              <description>
                DAC Channel 2 refresh Time (only valid
                in sample &amp;amp; hold mode) Refresh time=
                (TREFRESH[7:0]) x T LSI
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
