bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32L562.svd
        <register>
          <name>FDCAN_TXBRP</name>
          <displayName>FDCAN_TXBRP</displayName>
          <description>
            FDCAN Tx Buffer Request Pending
            Register
          </description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRP</name>
              <description>
                Transmission Request
                Pending
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCAN_TXBAR</name>
          <displayName>FDCAN_TXBAR</displayName>
          <description>
            FDCAN Tx Buffer Add Request
            Register
          </description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AR</name>
              <description>Add Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCAN_TXBCR</name>
          <displayName>FDCAN_TXBCR</displayName>
          <description>
            FDCAN Tx Buffer Cancellation Request
            Register
          </description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CR</name>
              <description>Cancellation Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCAN_TXBTO</name>
          <displayName>FDCAN_TXBTO</displayName>
          <description>
            FDCAN Tx Buffer Transmission Occurred
            Register
          </description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TO</name>
              <description>Transmission Occurred.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCAN_TXBCF</name>
          <displayName>FDCAN_TXBCF</displayName>
          <description>
            FDCAN Tx Buffer Cancellation Finished
            Register
          </description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CF</name>
              <description>Cancellation Finished</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCAN_TXBTIE</name>
          <displayName>FDCAN_TXBTIE</displayName>
          <description>
            FDCAN Tx Buffer Transmission Interrupt
            Enable Register
          </description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIE</name>
              <description>
                Transmission Interrupt
                Enable
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCAN_TXBCIE</name>
          <displayName>FDCAN_TXBCIE</displayName>
          <description>
            FDCAN Tx Buffer Cancellation Finished
            Interrupt Enable Register
          </description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CF</name>
              <description>
                Cancellation Finished Interrupt
                Enable
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCAN_TXEFS</name>
          <displayName>FDCAN_TXEFS</displayName>
          <description>
            FDCAN Tx Event FIFO Status
            Register
          </description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EFFL</name>
              <description>Event FIFO Fill Level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EFGI</name>
              <description>Event FIFO Get Index.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EFF</name>
              <description>Event FIFO Full.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEFL</name>
              <description>
                Tx Event FIFO Element
                Lost.
              </description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EFPI</name>
              <description>Event FIFO Put Index</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCAN_TXEFA</name>
          <displayName>FDCAN_TXEFA</displayName>
          <description>
            FDCAN Tx Event FIFO Acknowledge
            Register
          </description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EFAI</name>
              <description>
                Event FIFO Acknowledge
                Index
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCAN_CKDIV</name>
          <displayName>FDCAN_CKDIV</displayName>
          <description>
            FDCAN TT Trigger Memory Configuration
            Register
          </description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PDIV</name>
              <description>PDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCAN_TXBC</name>
          <displayName>FDCAN_TXBC</displayName>
          <description>
            FDCAN Tx buffer configuration
            register
          </description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TFQM</name>
              <description>Tx FIFO/Queue Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
