bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32L562.svd
        <register>
          <name>FMC_BCR3</name>
          <displayName>FMC_BCR3</displayName>
          <description>>FMC_BCR3</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000030D2</resetValue>
          <fields>
            <field>
              <name>MBKEN</name>
              <description>
                Memory bank enable bit This bit enables
                the memory bank. After reset Bank1 is enabled, all
                others are disabled. Accessing a disabled bank causes
                an ERROR on AXI bus.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXEN</name>
              <description>
                Address/data multiplexing enable bit
                When this bit is set, the address and data values are
                multiplexed on the data bus, valid only with NOR and
                PSRAM memories:
              </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTYP</name>
              <description>
                Memory type These bits define the type
                of external memory attached to the corresponding
                memory bank:
              </description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MWID</name>
              <description>
                Memory data bus width Defines the
                external memory device width, valid for all type of
                memories.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FACCEN</name>
              <description>
                Flash access enable This bit enables NOR
                Flash memory access operations.
              </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BURSTEN</name>
              <description>
                Burst enable bit This bit
                enables/disables synchronous accesses during read
                operations. It is valid only for synchronous memories
                operating in Burst mode:
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITPOL</name>
              <description>
                Wait signal polarity bit This bit
                defines the polarity of the wait signal from memory
                used for either in synchronous or asynchronous
                mode:
              </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITCFG</name>
              <description>
                Wait timing configuration The NWAIT
                signal indicates whether the data from the memory are
                valid or if a wait state must be inserted when
                accessing the memory in synchronous mode. This
                configuration bit determines if NWAIT is asserted by
                the memory one clock cycle before the wait state or
                during the wait state:
              </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WREN</name>
              <description>
                Write enable bit This bit indicates
                whether write operations are enabled/disabled in the
                bank by the FMC:
              </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITEN</name>
              <description>
                Wait enable bit This bit
                enables/disables wait-state insertion via the NWAIT
                signal when accessing the memory in synchronous
                mode.
              </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTMOD</name>
              <description>
                Extended mode enable. This bit enables
                the FMC to program the write timings for asynchronous
                accesses inside the FMC_BWTR register, thus resulting
                in different timings for read and write operations.
                Note: When the extended mode is disabled, the FMC can
                operate in Mode1 or Mode2 as follows: ** Mode 1 is
                the default mode when the SRAM/PSRAM memory type is
                selected (MTYP =0x0 or 0x01) ** Mode 2 is the default
                mode when the NOR memory type is selected (MTYP =
                0x10).
              </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASYNCWAIT</name>
              <description>
                Wait signal during asynchronous
                transfers This bit enables/disables the FMC to use
                the wait signal even during an asynchronous
                protocol.
              </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPSIZE</name>
              <description>
                CRAM Page Size These are used for
                Cellular RAM 1.5 which does not allow burst access to
                cross the address boundaries between pages. When
                these bits are configured, the FMC controller splits
                automatically the burst access when the memory page
                size is reached (refer to memory datasheet for page
                size). Other configuration: reserved.
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CBURSTRW</name>
              <description>
                Write burst enable For PSRAM (CRAM)
                operating in Burst mode, the bit enables synchronous
                accesses during write operations. The enable bit for
                synchronous read accesses is the BURSTEN bit in the
                FMC_BCRx register.
              </description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCLKEN</name>
              <description>
                Continuous Clock Enable This bit enables
                the FMC_CLK clock output to external memory devices.
                Note: The CCLKEN bit of the FMC_BCR2..4 registers is
                dont care. It is only enabled through the FMC_BCR1
                register. Bank 1 must be configured in synchronous
                mode to generate the FMC_CLK continuous clock. If
                CCLKEN bit is set, the FMC_CLK clock ratio is
                specified by CLKDIV value in the FMC_BTR1 register.
                CLKDIV in FMC_BWTR1 is dont care. If the synchronous
                mode is used and CCLKEN bit is set, the synchronous
                memories connected to other banks than Bank 1 are
                clocked by the same clock (the CLKDIV value in the
                FMC_BTR2..4 and FMC_BWTR2..4 registers for other
                banks has no effect.)
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WFDIS</name>
              <description>
                Write FIFO Disable This bit disables the
                Write FIFO used by the FMC controller. Note: The
                WFDIS bit of the FMC_BCR2..4 registers is dont care.
                It is only enabled through the FMC_BCR1
                register.
              </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBLSET</name>
              <description>NBLSET</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_BCR4</name>
          <displayName>FMC_BCR4</displayName>
          <description>>FMC_BCR4</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000030D2</resetValue>
          <fields>
            <field>
              <name>MBKEN</name>
              <description>
                Memory bank enable bit This bit enables
                the memory bank. After reset Bank1 is enabled, all
                others are disabled. Accessing a disabled bank causes
                an ERROR on AXI bus.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXEN</name>
              <description>
                Address/data multiplexing enable bit
                When this bit is set, the address and data values are
                multiplexed on the data bus, valid only with NOR and
                PSRAM memories:
              </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTYP</name>
              <description>
                Memory type These bits define the type
                of external memory attached to the corresponding
                memory bank:
              </description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MWID</name>
              <description>
                Memory data bus width Defines the
                external memory device width, valid for all type of
                memories.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FACCEN</name>
              <description>
                Flash access enable This bit enables NOR
                Flash memory access operations.
              </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BURSTEN</name>
              <description>
                Burst enable bit This bit
                enables/disables synchronous accesses during read
                operations. It is valid only for synchronous memories
                operating in Burst mode:
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITPOL</name>
              <description>
                Wait signal polarity bit This bit
                defines the polarity of the wait signal from memory
                used for either in synchronous or asynchronous
                mode:
              </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITCFG</name>
              <description>
                Wait timing configuration The NWAIT
                signal indicates whether the data from the memory are
                valid or if a wait state must be inserted when
                accessing the memory in synchronous mode. This
                configuration bit determines if NWAIT is asserted by
                the memory one clock cycle before the wait state or
                during the wait state:
              </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WREN</name>
              <description>
                Write enable bit This bit indicates
                whether write operations are enabled/disabled in the
                bank by the FMC:
              </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITEN</name>
              <description>
                Wait enable bit This bit
                enables/disables wait-state insertion via the NWAIT
                signal when accessing the memory in synchronous
                mode.
              </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTMOD</name>
              <description>
                Extended mode enable. This bit enables
                the FMC to program the write timings for asynchronous
                accesses inside the FMC_BWTR register, thus resulting
                in different timings for read and write operations.
                Note: When the extended mode is disabled, the FMC can
                operate in Mode1 or Mode2 as follows: ** Mode 1 is
                the default mode when the SRAM/PSRAM memory type is
                selected (MTYP =0x0 or 0x01) ** Mode 2 is the default
                mode when the NOR memory type is selected (MTYP =
                0x10).
              </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASYNCWAIT</name>
              <description>
                Wait signal during asynchronous
                transfers This bit enables/disables the FMC to use
                the wait signal even during an asynchronous
                protocol.
              </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPSIZE</name>
              <description>
                CRAM Page Size These are used for
                Cellular RAM 1.5 which does not allow burst access to
                cross the address boundaries between pages. When
                these bits are configured, the FMC controller splits
                automatically the burst access when the memory page
                size is reached (refer to memory datasheet for page
                size). Other configuration: reserved.
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CBURSTRW</name>
              <description>
                Write burst enable For PSRAM (CRAM)
                operating in Burst mode, the bit enables synchronous
                accesses during write operations. The enable bit for
                synchronous read accesses is the BURSTEN bit in the
                FMC_BCRx register.
              </description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCLKEN</name>
              <description>
                Continuous Clock Enable This bit enables
                the FMC_CLK clock output to external memory devices.
                Note: The CCLKEN bit of the FMC_BCR2..4 registers is
                dont care. It is only enabled through the FMC_BCR1
                register. Bank 1 must be configured in synchronous
                mode to generate the FMC_CLK continuous clock. If
                CCLKEN bit is set, the FMC_CLK clock ratio is
                specified by CLKDIV value in the FMC_BTR1 register.
                CLKDIV in FMC_BWTR1 is dont care. If the synchronous
                mode is used and CCLKEN bit is set, the synchronous
                memories connected to other banks than Bank 1 are
                clocked by the same clock (the CLKDIV value in the
                FMC_BTR2..4 and FMC_BWTR2..4 registers for other
                banks has no effect.)
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WFDIS</name>
              <description>
                Write FIFO Disable This bit disables the
                Write FIFO used by the FMC controller. Note: The
                WFDIS bit of the FMC_BCR2..4 registers is dont care.
                It is only enabled through the FMC_BCR1
                register.
              </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBLSET</name>
              <description>NBLSET</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
