bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32L562.svd
        <register>
          <name>FMC_BTR1</name>
          <displayName>FMC_BTR1</displayName>
          <description>
            This register contains the control
            information of each memory bank, used for SRAMs, PSRAM
            and NOR Flash memories.If the EXTMOD bit is set in the
            FMC_BCRx register, then this register is partitioned for
            write and read access, that is, 2 registers are
            available: one to configure read accesses (this register)
            and one to configure write accesses (FMC_BWTRx
            registers).
          </description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>
                Address setup phase duration These bits
                are written by software to define the duration of the
                address setup phase (refer to Figure81 to Figure93),
                used in SRAMs, ROMs and asynchronous NOR Flash: For
                each access mode address setup phase duration, please
                refer to the respective figure (refer to Figure81 to
                Figure93). Note: In synchronous accesses, this value
                is dont care. In Muxed mode or Mode D, the minimum
                value for ADDSET is 1.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>
                Address-hold phase duration These bits
                are written by software to define the duration of the
                address hold phase (refer to Figure81 to Figure93),
                used in mode D or multiplexed accesses: For each
                access mode address-hold phase duration, please refer
                to the respective figure (Figure81 to Figure93).
                Note: In synchronous accesses, this value is not
                used, the address hold phase is always 1 memory clock
                period duration.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>
                Data-phase duration These bits are
                written by software to define the duration of the
                data phase (refer to Figure81 to Figure93), used in
                asynchronous accesses: For each memory type and
                access mode data-phase duration, please refer to the
                respective figure (Figure81 to Figure93). Example:
                Mode1, write access, DATAST=1: Data-phase duration=
                DATAST+1 = 2 KCK_FMC clock cycles. Note: In
                synchronous accesses, this value is dont
                care.
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>
                Bus turnaround phase duration These bits
                are written by software to add a delay at the end of
                a write-to-read or read-to write transaction. The
                programmed bus turnaround delay is inserted between
                an asynchronous read (in muxed or mode D) or write
                transaction and any other asynchronous /synchronous
                read/write from/to a static bank. If a read operation
                is performed, the bank can be the same or a different
                one, whereas it must be different in case of write
                operation to the bank, except in muxed mode or mode
                D. In some cases, whatever the programmed BUSTRUN
                values, the bus turnaround delay is fixed as follows:
                The bus turnaround delay is not inserted between two
                consecutive asynchronous write transfers to the same
                static memory bank except in muxed mode and mode D.
                There is a bus turnaround delay of 1 FMC clock cycle
                between: Two consecutive asynchronous read transfers
                to the same static memory bank except for modes muxed
                and D. An asynchronous read to an asynchronous or
                synchronous write to any static bank or dynamic bank
                except in modes muxed and D mode. There is a bus
                turnaround delay of 2 FMC clock cycle between: Two
                consecutive synchronous write operations (in Burst or
                Single mode) to the same bank. A synchronous write
                (burst or single) access and an asynchronous write or
                read transfer to or from static memory bank (the bank
                can be the same or a different one in case of a read
                operation. Two consecutive synchronous read
                operations (in Burst or Single mode) followed by any
                synchronous/asynchronous read or write from/to
                another static memory bank. There is a bus turnaround
                delay of 3 FMC clock cycle between: Two consecutive
                synchronous write operations (in Burst or Single
                mode) to different static banks. A synchronous write
                access (in Burst or Single mode) and a synchronous
                read from the same or a different bank. The bus
                turnaround delay allows to match the minimum time
                between consecutive transactions (tEHEL from NEx high
                to NEx low) and the maximum time required by the
                memory to free the data bus after a read access
                (tEHQZ): (BUSTRUN + 1) KCK_FMC period &amp;#8805;
                tEHELmin and (BUSTRUN + 2)KCK_FMC period &amp;#8805;
                tEHQZmax if EXTMOD = 0 (BUSTRUN + 2)KCK_FMC period
                &amp;#8805; max (tEHELmin, tEHQZmax) if EXTMOD = 126.
                ...
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>
                Clock divide ratio (for FMC_CLK signal)
                These bits define the period of FMC_CLK clock output
                signal, expressed in number of KCK_FMC cycles: In
                asynchronous NOR Flash, SRAM or PSRAM accesses, this
                value is dont care. Note: Refer to Section20.6.5:
                Synchronous transactions for FMC_CLK divider ratio
                formula)
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATLAT</name>
              <description>
                Data latency for synchronous memory For
                synchronous access with read write burst mode enabled
                these bits define the number of memory clock
                cycles
              </description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>
                Access mode These bits specify the
                asynchronous access modes as shown in the timing
                diagrams. They are taken into account only when the
                EXTMOD bit in the FMC_BCRx register is
                1.
              </description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DATAHLD</name>
              <description>DATAHLD</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_BTR2</name>
          <displayName>FMC_BTR2</displayName>
          <description>FMC_BTR2</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>
                Address setup phase duration These bits
                are written by software to define the duration of the
                address setup phase (refer to Figure81 to Figure93),
                used in SRAMs, ROMs and asynchronous NOR Flash: For
                each access mode address setup phase duration, please
                refer to the respective figure (refer to Figure81 to
                Figure93). Note: In synchronous accesses, this value
                is dont care. In Muxed mode or Mode D, the minimum
                value for ADDSET is 1.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>
                Address-hold phase duration These bits
                are written by software to define the duration of the
                address hold phase (refer to Figure81 to Figure93),
                used in mode D or multiplexed accesses: For each
                access mode address-hold phase duration, please refer
                to the respective figure (Figure81 to Figure93).
                Note: In synchronous accesses, this value is not
                used, the address hold phase is always 1 memory clock
                period duration.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>
                Data-phase duration These bits are
                written by software to define the duration of the
                data phase (refer to Figure81 to Figure93), used in
                asynchronous accesses: For each memory type and
                access mode data-phase duration, please refer to the
                respective figure (Figure81 to Figure93). Example:
                Mode1, write access, DATAST=1: Data-phase duration=
                DATAST+1 = 2 KCK_FMC clock cycles. Note: In
                synchronous accesses, this value is dont
                care.
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>
                Bus turnaround phase duration These bits
                are written by software to add a delay at the end of
                a write-to-read or read-to write transaction. The
                programmed bus turnaround delay is inserted between
                an asynchronous read (in muxed or mode D) or write
                transaction and any other asynchronous /synchronous
                read/write from/to a static bank. If a read operation
                is performed, the bank can be the same or a different
                one, whereas it must be different in case of write
                operation to the bank, except in muxed mode or mode
                D. In some cases, whatever the programmed BUSTRUN
                values, the bus turnaround delay is fixed as follows:
                The bus turnaround delay is not inserted between two
                consecutive asynchronous write transfers to the same
                static memory bank except in muxed mode and mode D.
                There is a bus turnaround delay of 1 FMC clock cycle
                between: Two consecutive asynchronous read transfers
                to the same static memory bank except for modes muxed
                and D. An asynchronous read to an asynchronous or
                synchronous write to any static bank or dynamic bank
                except in modes muxed and D mode. There is a bus
                turnaround delay of 2 FMC clock cycle between: Two
                consecutive synchronous write operations (in Burst or
                Single mode) to the same bank. A synchronous write
                (burst or single) access and an asynchronous write or
                read transfer to or from static memory bank (the bank
                can be the same or a different one in case of a read
                operation. Two consecutive synchronous read
                operations (in Burst or Single mode) followed by any
                synchronous/asynchronous read or write from/to
                another static memory bank. There is a bus turnaround
                delay of 3 FMC clock cycle between: Two consecutive
                synchronous write operations (in Burst or Single
                mode) to different static banks. A synchronous write
                access (in Burst or Single mode) and a synchronous
                read from the same or a different bank. The bus
                turnaround delay allows to match the minimum time
                between consecutive transactions (tEHEL from NEx high
                to NEx low) and the maximum time required by the
                memory to free the data bus after a read access
                (tEHQZ): (BUSTRUN + 1) KCK_FMC period &amp;#8805;
                tEHELmin and (BUSTRUN + 2)KCK_FMC period &amp;#8805;
                tEHQZmax if EXTMOD = 0 (BUSTRUN + 2)KCK_FMC period
                &amp;#8805; max (tEHELmin, tEHQZmax) if EXTMOD = 126.
                ...
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>
                Clock divide ratio (for FMC_CLK signal)
                These bits define the period of FMC_CLK clock output
                signal, expressed in number of KCK_FMC cycles: In
                asynchronous NOR Flash, SRAM or PSRAM accesses, this
                value is dont care. Note: Refer to Section20.6.5:
                Synchronous transactions for FMC_CLK divider ratio
                formula)
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATLAT</name>
              <description>
                Data latency for synchronous memory For
                synchronous access with read write burst mode enabled
                these bits define the number of memory clock
                cycles
              </description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>
                Access mode These bits specify the
                asynchronous access modes as shown in the timing
                diagrams. They are taken into account only when the
                EXTMOD bit in the FMC_BCRx register is
                1.
              </description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DATAHLD</name>
              <description>DATAHLD</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_BTR3</name>
          <displayName>FMC_BTR3</displayName>
          <description>FMC_BTR3</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>
                Address setup phase duration These bits
                are written by software to define the duration of the
                address setup phase (refer to Figure81 to Figure93),
                used in SRAMs, ROMs and asynchronous NOR Flash: For
                each access mode address setup phase duration, please
                refer to the respective figure (refer to Figure81 to
                Figure93). Note: In synchronous accesses, this value
                is dont care. In Muxed mode or Mode D, the minimum
                value for ADDSET is 1.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>
                Address-hold phase duration These bits
                are written by software to define the duration of the
                address hold phase (refer to Figure81 to Figure93),
                used in mode D or multiplexed accesses: For each
                access mode address-hold phase duration, please refer
                to the respective figure (Figure81 to Figure93).
                Note: In synchronous accesses, this value is not
                used, the address hold phase is always 1 memory clock
                period duration.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>
                Data-phase duration These bits are
                written by software to define the duration of the
                data phase (refer to Figure81 to Figure93), used in
                asynchronous accesses: For each memory type and
                access mode data-phase duration, please refer to the
                respective figure (Figure81 to Figure93). Example:
                Mode1, write access, DATAST=1: Data-phase duration=
                DATAST+1 = 2 KCK_FMC clock cycles. Note: In
                synchronous accesses, this value is dont
                care.
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>
                Bus turnaround phase duration These bits
                are written by software to add a delay at the end of
                a write-to-read or read-to write transaction. The
                programmed bus turnaround delay is inserted between
                an asynchronous read (in muxed or mode D) or write
                transaction and any other asynchronous /synchronous
                read/write from/to a static bank. If a read operation
                is performed, the bank can be the same or a different
                one, whereas it must be different in case of write
                operation to the bank, except in muxed mode or mode
                D. In some cases, whatever the programmed BUSTRUN
                values, the bus turnaround delay is fixed as follows:
                The bus turnaround delay is not inserted between two
                consecutive asynchronous write transfers to the same
                static memory bank except in muxed mode and mode D.
                There is a bus turnaround delay of 1 FMC clock cycle
                between: Two consecutive asynchronous read transfers
                to the same static memory bank except for modes muxed
                and D. An asynchronous read to an asynchronous or
                synchronous write to any static bank or dynamic bank
                except in modes muxed and D mode. There is a bus
                turnaround delay of 2 FMC clock cycle between: Two
                consecutive synchronous write operations (in Burst or
                Single mode) to the same bank. A synchronous write
                (burst or single) access and an asynchronous write or
                read transfer to or from static memory bank (the bank
                can be the same or a different one in case of a read
                operation. Two consecutive synchronous read
                operations (in Burst or Single mode) followed by any
                synchronous/asynchronous read or write from/to
                another static memory bank. There is a bus turnaround
                delay of 3 FMC clock cycle between: Two consecutive
                synchronous write operations (in Burst or Single
                mode) to different static banks. A synchronous write
                access (in Burst or Single mode) and a synchronous
                read from the same or a different bank. The bus
                turnaround delay allows to match the minimum time
                between consecutive transactions (tEHEL from NEx high
                to NEx low) and the maximum time required by the
                memory to free the data bus after a read access
                (tEHQZ): (BUSTRUN + 1) KCK_FMC period &amp;#8805;
                tEHELmin and (BUSTRUN + 2)KCK_FMC period &amp;#8805;
                tEHQZmax if EXTMOD = 0 (BUSTRUN + 2)KCK_FMC period
                &amp;#8805; max (tEHELmin, tEHQZmax) if EXTMOD = 126.
                ...
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>
                Clock divide ratio (for FMC_CLK signal)
                These bits define the period of FMC_CLK clock output
                signal, expressed in number of KCK_FMC cycles: In
                asynchronous NOR Flash, SRAM or PSRAM accesses, this
                value is dont care. Note: Refer to Section20.6.5:
                Synchronous transactions for FMC_CLK divider ratio
                formula)
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATLAT</name>
              <description>
                Data latency for synchronous memory For
                synchronous access with read write burst mode enabled
                these bits define the number of memory clock
                cycles
              </description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>
                Access mode These bits specify the
                asynchronous access modes as shown in the timing
                diagrams. They are taken into account only when the
                EXTMOD bit in the FMC_BCRx register is
                1.
              </description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DATAHLD</name>
              <description>DATAHLD</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
