bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32L562.svd
        <register>
          <name>FMC_BWTR1</name>
          <displayName>FMC_BWTR1</displayName>
          <description>
            This register contains the control
            information of each memory bank. It is used for SRAMs,
            PSRAMs and NOR Flash memories. When the EXTMOD bit is set
            in the FMC_BCRx register, then this register is active
            for write access.
          </description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>
                Address setup phase duration. These bits
                are written by software to define the duration of the
                address setup phase in KCK_FMC cycles (refer to
                Figure81 to Figure93), used in asynchronous accesses:
                ... Note: In synchronous accesses, this value is not
                used, the address setup phase is always 1 Flash clock
                period duration. In muxed mode, the minimum ADDSET
                value is 1.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>
                Address-hold phase duration. These bits
                are written by software to define the duration of the
                address hold phase (refer to Figure81 to Figure93),
                used in asynchronous multiplexed accesses: ... Note:
                In synchronous NOR Flash accesses, this value is not
                used, the address hold phase is always 1 Flash clock
                period duration.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>
                Data-phase duration. These bits are
                written by software to define the duration of the
                data phase (refer to Figure81 to Figure93), used in
                asynchronous SRAM, PSRAM and NOR Flash memory
                accesses:
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>
                Bus turnaround phase duration These bits
                are written by software to add a delay at the end of
                a write transaction to match the minimum time between
                consecutive transactions (tEHEL from ENx high to ENx
                low): (BUSTRUN + 1) KCK_FMC period &amp;#8805;
                tEHELmin. The programmed bus turnaround delay is
                inserted between a an asynchronous write transfer and
                any other asynchronous /synchronous read or write
                transfer to or from a static bank. If a read
                operation is performed, the bank can be the same or a
                different one, whereas it must be different in case
                of write operation to the bank, except in muxed mode
                or mode D. In some cases, whatever the programmed
                BUSTRUN values, the bus turnaround delay is fixed as
                follows: The bus turnaround delay is not inserted
                between two consecutive asynchronous write transfers
                to the same static memory bank except for muxed mode
                and mode D. There is a bus turnaround delay of 2 FMC
                clock cycle between: Two consecutive synchronous
                write operations (in Burst or Single mode) to the
                same bank A synchronous write transfer ((in Burst or
                Single mode) and an asynchronous write or read
                transfer to or from static memory bank. There is a
                bus turnaround delay of 3 FMC clock cycle between:
                Two consecutive synchronous write operations (in
                Burst or Single mode) to different static banks. A
                synchronous write transfer (in Burst or Single mode)
                and a synchronous read from the same or a different
                bank. ...
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>
                Access mode. These bits specify the
                asynchronous access modes as shown in the next timing
                diagrams.These bits are taken into account only when
                the EXTMOD bit in the FMC_BCRx register is
                1.
              </description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_BWTR2</name>
          <displayName>FMC_BWTR2</displayName>
          <description>
            This register contains the control
            information of each memory bank. It is used for SRAMs,
            PSRAMs and NOR Flash memories. When the EXTMOD bit is set
            in the FMC_BCRx register, then this register is active
            for write access.
          </description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>
                Address setup phase duration. These bits
                are written by software to define the duration of the
                address setup phase in KCK_FMC cycles (refer to
                Figure81 to Figure93), used in asynchronous accesses:
                ... Note: In synchronous accesses, this value is not
                used, the address setup phase is always 1 Flash clock
                period duration. In muxed mode, the minimum ADDSET
                value is 1.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>
                Address-hold phase duration. These bits
                are written by software to define the duration of the
                address hold phase (refer to Figure81 to Figure93),
                used in asynchronous multiplexed accesses: ... Note:
                In synchronous NOR Flash accesses, this value is not
                used, the address hold phase is always 1 Flash clock
                period duration.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>
                Data-phase duration. These bits are
                written by software to define the duration of the
                data phase (refer to Figure81 to Figure93), used in
                asynchronous SRAM, PSRAM and NOR Flash memory
                accesses:
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>
                Bus turnaround phase duration These bits
                are written by software to add a delay at the end of
                a write transaction to match the minimum time between
                consecutive transactions (tEHEL from ENx high to ENx
                low): (BUSTRUN + 1) KCK_FMC period &amp;#8805;
                tEHELmin. The programmed bus turnaround delay is
                inserted between a an asynchronous write transfer and
                any other asynchronous /synchronous read or write
                transfer to or from a static bank. If a read
                operation is performed, the bank can be the same or a
                different one, whereas it must be different in case
                of write operation to the bank, except in muxed mode
                or mode D. In some cases, whatever the programmed
                BUSTRUN values, the bus turnaround delay is fixed as
                follows: The bus turnaround delay is not inserted
                between two consecutive asynchronous write transfers
                to the same static memory bank except for muxed mode
                and mode D. There is a bus turnaround delay of 2 FMC
                clock cycle between: Two consecutive synchronous
                write operations (in Burst or Single mode) to the
                same bank A synchronous write transfer ((in Burst or
                Single mode) and an asynchronous write or read
                transfer to or from static memory bank. There is a
                bus turnaround delay of 3 FMC clock cycle between:
                Two consecutive synchronous write operations (in
                Burst or Single mode) to different static banks. A
                synchronous write transfer (in Burst or Single mode)
                and a synchronous read from the same or a different
                bank. ...
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>
                Access mode. These bits specify the
                asynchronous access modes as shown in the next timing
                diagrams.These bits are taken into account only when
                the EXTMOD bit in the FMC_BCRx register is
                1.
              </description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_BWTR3</name>
          <displayName>FMC_BWTR3</displayName>
          <description>
            This register contains the control
            information of each memory bank. It is used for SRAMs,
            PSRAMs and NOR Flash memories. When the EXTMOD bit is set
            in the FMC_BCRx register, then this register is active
            for write access.
          </description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>
                Address setup phase duration. These bits
                are written by software to define the duration of the
                address setup phase in KCK_FMC cycles (refer to
                Figure81 to Figure93), used in asynchronous accesses:
                ... Note: In synchronous accesses, this value is not
                used, the address setup phase is always 1 Flash clock
                period duration. In muxed mode, the minimum ADDSET
                value is 1.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>
                Address-hold phase duration. These bits
                are written by software to define the duration of the
                address hold phase (refer to Figure81 to Figure93),
                used in asynchronous multiplexed accesses: ... Note:
                In synchronous NOR Flash accesses, this value is not
                used, the address hold phase is always 1 Flash clock
                period duration.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>
                Data-phase duration. These bits are
                written by software to define the duration of the
                data phase (refer to Figure81 to Figure93), used in
                asynchronous SRAM, PSRAM and NOR Flash memory
                accesses:
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>
                Bus turnaround phase duration These bits
                are written by software to add a delay at the end of
                a write transaction to match the minimum time between
                consecutive transactions (tEHEL from ENx high to ENx
                low): (BUSTRUN + 1) KCK_FMC period &amp;#8805;
                tEHELmin. The programmed bus turnaround delay is
                inserted between a an asynchronous write transfer and
                any other asynchronous /synchronous read or write
                transfer to or from a static bank. If a read
                operation is performed, the bank can be the same or a
                different one, whereas it must be different in case
                of write operation to the bank, except in muxed mode
                or mode D. In some cases, whatever the programmed
                BUSTRUN values, the bus turnaround delay is fixed as
                follows: The bus turnaround delay is not inserted
                between two consecutive asynchronous write transfers
                to the same static memory bank except for muxed mode
                and mode D. There is a bus turnaround delay of 2 FMC
                clock cycle between: Two consecutive synchronous
                write operations (in Burst or Single mode) to the
                same bank A synchronous write transfer ((in Burst or
                Single mode) and an asynchronous write or read
                transfer to or from static memory bank. There is a
                bus turnaround delay of 3 FMC clock cycle between:
                Two consecutive synchronous write operations (in
                Burst or Single mode) to different static banks. A
                synchronous write transfer (in Burst or Single mode)
                and a synchronous read from the same or a different
                bank. ...
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>
                Access mode. These bits specify the
                asynchronous access modes as shown in the next timing
                diagrams.These bits are taken into account only when
                the EXTMOD bit in the FMC_BCRx register is
                1.
              </description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_BWTR4</name>
          <displayName>FMC_BWTR4</displayName>
          <description>
            This register contains the control
            information of each memory bank. It is used for SRAMs,
            PSRAMs and NOR Flash memories. When the EXTMOD bit is set
            in the FMC_BCRx register, then this register is active
            for write access.
          </description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>
                Address setup phase duration. These bits
                are written by software to define the duration of the
                address setup phase in KCK_FMC cycles (refer to
                Figure81 to Figure93), used in asynchronous accesses:
                ... Note: In synchronous accesses, this value is not
                used, the address setup phase is always 1 Flash clock
                period duration. In muxed mode, the minimum ADDSET
                value is 1.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>
                Address-hold phase duration. These bits
                are written by software to define the duration of the
                address hold phase (refer to Figure81 to Figure93),
                used in asynchronous multiplexed accesses: ... Note:
                In synchronous NOR Flash accesses, this value is not
                used, the address hold phase is always 1 Flash clock
                period duration.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>
                Data-phase duration. These bits are
                written by software to define the duration of the
                data phase (refer to Figure81 to Figure93), used in
                asynchronous SRAM, PSRAM and NOR Flash memory
                accesses:
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>
                Bus turnaround phase duration These bits
                are written by software to add a delay at the end of
                a write transaction to match the minimum time between
                consecutive transactions (tEHEL from ENx high to ENx
                low): (BUSTRUN + 1) KCK_FMC period &amp;#8805;
                tEHELmin. The programmed bus turnaround delay is
                inserted between a an asynchronous write transfer and
                any other asynchronous /synchronous read or write
                transfer to or from a static bank. If a read
                operation is performed, the bank can be the same or a
                different one, whereas it must be different in case
                of write operation to the bank, except in muxed mode
                or mode D. In some cases, whatever the programmed
                BUSTRUN values, the bus turnaround delay is fixed as
                follows: The bus turnaround delay is not inserted
                between two consecutive asynchronous write transfers
                to the same static memory bank except for muxed mode
                and mode D. There is a bus turnaround delay of 2 FMC
                clock cycle between: Two consecutive synchronous
                write operations (in Burst or Single mode) to the
                same bank A synchronous write transfer ((in Burst or
                Single mode) and an asynchronous write or read
                transfer to or from static memory bank. There is a
                bus turnaround delay of 3 FMC clock cycle between:
                Two consecutive synchronous write operations (in
                Burst or Single mode) to different static banks. A
                synchronous write transfer (in Burst or Single mode)
                and a synchronous read from the same or a different
                bank. ...
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>
                Access mode. These bits specify the
                asynchronous access modes as shown in the next timing
                diagrams.These bits are taken into account only when
                the EXTMOD bit in the FMC_BCRx register is
                1.
              </description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCSCNTR</name>
          <displayName>PCSCNTR</displayName>
          <description>PCSCNTR</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CSCOUNT</name>
              <description>Chip select counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>CNTB1EN</name>
              <description>Counter Bank 1 enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNTB2EN</name>
              <description>Counter Bank 2 enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNTB3EN</name>
              <description>Counter Bank 3 enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNTB4EN</name>
              <description>Counter Bank 4 enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
