bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32L562.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="FMC">
      <name>SEC_FMC</name>
      <disableCondition>!(DCB-&gt;DSCSR &amp; (1 &lt;&lt; 16))</disableCondition>
      <baseAddress>0x54020000</baseAddress>
    </peripheral>
    <peripheral>
      <name>RNG</name>
      <description>RNG</description>
      <groupName>RNG</groupName>
      <baseAddress>0x420C0800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RNG</name>
        <description>RNG global interrupt</description>
        <value>94</value>
      </interrupt>
      <registers>
        <register>
          <name>RNG_CR</name>
          <displayName>RNG_CR</displayName>
          <description>RNG control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RNGEN</name>
              <description>
                Random number generator
                enable
              </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IE</name>
              <description>Interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CED</name>
              <description>
                Clock error detection Note: The clock
                error detection can be used only when ck_rc48 or
                ck_pll1_q (ck_pll1_q = 48MHz) source is selected
                otherwise, CED bit must be equal to 1. The clock
                error detection cannot be enabled nor disabled on the
                fly when RNG peripheral is enabled, to enable or
                disable CED the RNG must be disabled.
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNG_CONFIG3</name>
              <description>RNG configuration 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>NISTC</name>
              <description>Non NIST compliant</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNG_CONFIG2</name>
              <description>RNG configuration 2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Clock divider factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RNG_CONFIG1</name>
              <description>RNG configuration 1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CONDRST</name>
              <description>Conditioning soft reset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CONFIGLOCK</name>
              <description>RNG Config Lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_SR</name>
          <displayName>RNG_SR</displayName>
          <description>RNG status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DRDY</name>
              <description>
                Data ready Note: If IE=1 in RNG_CR, an
                interrupt is generated when DRDY=1. It can rise when
                the peripheral is disabled. When the output buffer
                becomes empty (after reading RNG_DR), this bit
                returns to 0 until a new random value is
                generated.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CECS</name>
              <description>
                Clock error current status Note: This
                bit is meaningless if CED (Clock error detection) bit
                in RNG_CR is equal to 1.
              </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECS</name>
              <description>
                Seed error current status ** More than
                64 consecutive bits at the same value (0 or 1) **
                More than 32 consecutive alternances of 0 and 1
                (0101010101...01)
              </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CEIS</name>
              <description>
                Clock error interrupt status This bit is
                set at the same time as CECS. It is cleared by
                writing it to 0. An interrupt is pending if IE = 1 in
                the RNG_CR register. Note: This bit is meaningless if
                CED (Clock error detection) bit in RNG_CR is equal to
                1.
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEIS</name>
              <description>
                Seed error interrupt status This bit is
                set at the same time as SECS. It is cleared by
                writing it to 0. ** More than 64 consecutive bits at
                the same value (0 or 1) ** More than 32 consecutive
                alternances of 0 and 1 (0101010101...01) An interrupt
                is pending if IE = 1 in the RNG_CR
                register.
              </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_DR</name>
          <displayName>RNG_DR</displayName>
          <description>
            The RNG_DR register is a read-only register
            that delivers a 32-bit random value when read. The
            content of this register is valid when DRDY= 1, even if
            RNGEN=0.
          </description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RNDATA</name>
              <description>
                Random data 32-bit random data which are
                valid when DRDY=1.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_HTCR</name>
          <displayName>RNG_HTCR</displayName>
          <description>
            The RNG_DR register is a read-only register
            that delivers a 32-bit random value when read. The
            content of this register is valid when DRDY= 1, even if
            RNGEN=0.
          </description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000CAA74</resetValue>
          <fields>
            <field>
              <name>HTCFG</name>
              <description>health test configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
