bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32L562.svd
        <register>
          <name>SDMMC_ICR</name>
          <displayName>SDMMC_ICR</displayName>
          <description>
            The SDMMC_ICR register is a write-only
            register. Writing a bit with 1 clears the corresponding
            bit in the SDMMC_STAR status register.
          </description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCRCFAILC</name>
              <description>
                CCRCFAIL flag clear bit Set by software
                to clear the CCRCFAIL flag.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCRCFAILC</name>
              <description>
                DCRCFAIL flag clear bit Set by software
                to clear the DCRCFAIL flag.
              </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTIMEOUTC</name>
              <description>
                CTIMEOUT flag clear bit Set by software
                to clear the CTIMEOUT flag.
              </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTIMEOUTC</name>
              <description>
                DTIMEOUT flag clear bit Set by software
                to clear the DTIMEOUT flag.
              </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUNDERRC</name>
              <description>
                TXUNDERR flag clear bit Set by software
                to clear TXUNDERR flag.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVERRC</name>
              <description>
                RXOVERR flag clear bit Set by software
                to clear the RXOVERR flag.
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDRENDC</name>
              <description>
                CMDREND flag clear bit Set by software
                to clear the CMDREND flag.
              </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDSENTC</name>
              <description>
                CMDSENT flag clear bit Set by software
                to clear the CMDSENT flag.
              </description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATAENDC</name>
              <description>
                DATAEND flag clear bit Set by software
                to clear the DATAEND flag.
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DHOLDC</name>
              <description>
                DHOLD flag clear bit Set by software to
                clear the DHOLD flag.
              </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBCKENDC</name>
              <description>
                DBCKEND flag clear bit Set by software
                to clear the DBCKEND flag.
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DABORTC</name>
              <description>
                DABORT flag clear bit Set by software to
                clear the DABORT flag.
              </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSYD0ENDC</name>
              <description>
                BUSYD0END flag clear bit Set by software
                to clear the BUSYD0END flag.
              </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIOITC</name>
              <description>
                SDIOIT flag clear bit Set by software to
                clear the SDIOIT flag.
              </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKFAILC</name>
              <description>
                ACKFAIL flag clear bit Set by software
                to clear the ACKFAIL flag.
              </description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKTIMEOUTC</name>
              <description>
                ACKTIMEOUT flag clear bit Set by
                software to clear the ACKTIMEOUT flag.
              </description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSWENDC</name>
              <description>
                VSWEND flag clear bit Set by software to
                clear the VSWEND flag.
              </description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKSTOPC</name>
              <description>
                CKSTOP flag clear bit Set by software to
                clear the CKSTOP flag.
              </description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDMATEC</name>
              <description>
                IDMA transfer error clear bit Set by
                software to clear the IDMATE flag.
              </description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDMABTCC</name>
              <description>
                IDMA buffer transfer complete clear bit
                Set by software to clear the IDMABTC
                flag.
              </description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_MASKR</name>
          <displayName>SDMMC_MASKR</displayName>
          <description>
            The interrupt mask register determines which
            status flags generate an interrupt request by setting the
            corresponding bit to 1.
          </description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCRCFAILIE</name>
              <description>
                Command CRC fail interrupt enable Set
                and cleared by software to enable/disable interrupt
                caused by command CRC failure.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCRCFAILIE</name>
              <description>
                Data CRC fail interrupt enable Set and
                cleared by software to enable/disable interrupt
                caused by data CRC failure.
              </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTIMEOUTIE</name>
              <description>
                Command timeout interrupt enable Set and
                cleared by software to enable/disable interrupt
                caused by command timeout.
              </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTIMEOUTIE</name>
              <description>
                Data timeout interrupt enable Set and
                cleared by software to enable/disable interrupt
                caused by data timeout.
              </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUNDERRIE</name>
              <description>
                Tx FIFO underrun error interrupt enable
                Set and cleared by software to enable/disable
                interrupt caused by Tx FIFO underrun
                error.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVERRIE</name>
              <description>
                Rx FIFO overrun error interrupt enable
                Set and cleared by software to enable/disable
                interrupt caused by Rx FIFO overrun
                error.
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDRENDIE</name>
              <description>
                Command response received interrupt
                enable Set and cleared by software to enable/disable
                interrupt caused by receiving command
                response.
              </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMDSENTIE</name>
              <description>
                Command sent interrupt enable Set and
                cleared by software to enable/disable interrupt
                caused by sending command.
              </description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATAENDIE</name>
              <description>
                Data end interrupt enable Set and
                cleared by software to enable/disable interrupt
                caused by data end.
              </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DHOLDIE</name>
              <description>
                Data hold interrupt enable Set and
                cleared by software to enable/disable the interrupt
                generated when sending new data is hold in the DPSM
                Wait_S state.
              </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBCKENDIE</name>
              <description>
                Data block end interrupt enable Set and
                cleared by software to enable/disable interrupt
                caused by data block end.
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DABORTIE</name>
              <description>
                Data transfer aborted interrupt enable
                Set and cleared by software to enable/disable
                interrupt caused by a data transfer being
                aborted.
              </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFIFOHEIE</name>
              <description>
                Tx FIFO half empty interrupt enable Set
                and cleared by software to enable/disable interrupt
                caused by Tx FIFO half empty.
              </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFIFOHFIE</name>
              <description>
                Rx FIFO half full interrupt enable Set
                and cleared by software to enable/disable interrupt
                caused by Rx FIFO half full.
              </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFIFOFIE</name>
              <description>
                Rx FIFO full interrupt enable Set and
                cleared by software to enable/disable interrupt
                caused by Rx FIFO full.
              </description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFIFOEIE</name>
              <description>
                Tx FIFO empty interrupt enable Set and
                cleared by software to enable/disable interrupt
                caused by Tx FIFO empty.
              </description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSYD0ENDIE</name>
              <description>
                BUSYD0END interrupt enable Set and
                cleared by software to enable/disable the interrupt
                generated when SDMMC_D0 signal changes from busy to
                NOT busy following a CMD response.
              </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIOITIE</name>
              <description>
                SDIO mode interrupt received interrupt
                enable Set and cleared by software to enable/disable
                the interrupt generated when receiving the SDIO mode
                interrupt.
              </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKFAILIE</name>
              <description>
                Acknowledgment Fail interrupt enable Set
                and cleared by software to enable/disable interrupt
                caused by acknowledgment Fail.
              </description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKTIMEOUTIE</name>
              <description>
                Acknowledgment timeout interrupt enable
                Set and cleared by software to enable/disable
                interrupt caused by acknowledgment
                timeout.
              </description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSWENDIE</name>
              <description>
                Voltage switch critical timing section
                completion interrupt enable Set and cleared by
                software to enable/disable the interrupt generated
                when voltage switch critical timing section
                completion.
              </description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKSTOPIE</name>
              <description>
                Voltage Switch clock stopped interrupt
                enable Set and cleared by software to enable/disable
                interrupt caused by Voltage Switch clock
                stopped.
              </description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDMABTCIE</name>
              <description>
                IDMA buffer transfer complete interrupt
                enable Set and cleared by software to enable/disable
                the interrupt generated when the IDMA has transferred
                all data belonging to a memory buffer.
              </description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_ACKTIMER</name>
          <displayName>SDMMC_ACKTIMER</displayName>
          <description>
            The SDMMC_ACKTIMER register contains the
            acknowledgment timeout period, in SDMMC_CK bus clock
            periods. A counter loads the value from the
            SDMMC_ACKTIMER register, and starts decrementing when the
            data path state machine (DPSM) enters the Wait_Ack state.
            If the timer reaches 0 while the DPSM is in this states,
            the acknowledgment timeout status flag is
            set.
          </description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACKTIME</name>
              <description>
                Boot acknowledgment timeout period This
                bit can only be written by firmware when CPSM is
                disabled (CPSMEN = 0). Boot acknowledgment timeout
                period expressed in card bus clock
                periods.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_IDMACTRLR</name>
          <displayName>SDMMC_IDMACTRLR</displayName>
          <description>
            The receive and transmit FIFOs can be read
            or written as 32-bit wide registers. The FIFOs contain 32
            entries on 32 sequential addresses. This allows the CPU
            to use its load and store multiple operands to read
            from/write to the FIFO.
          </description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDMAEN</name>
              <description>
                IDMA enable This bit can only be written
                by firmware when DPSM is inactive (DPSMACT =
                0).
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDMABMODE</name>
              <description>
                Buffer mode selection. This bit can only
                be written by firmware when DPSM is inactive (DPSMACT
                = 0).
              </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDMABACT</name>
              <description>
                Double buffer mode active buffer
                indication This bit can only be written by firmware
                when DPSM is inactive (DPSMACT = 0). When IDMA is
                enabled this bit is toggled by
                hardware.
              </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_IDMABSIZER</name>
          <displayName>SDMMC_IDMABSIZER</displayName>
          <description>
            The SDMMC_IDMABSIZER register contains the
            buffers size when in double buffer
            configuration.
          </description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDMABNDT</name>
              <description>
                Number of transfers per buffer. This
                8-bit value shall be multiplied by 8 to get the size
                of the buffer in 32-bit words and by 32 to get the
                size of the buffer in bytes. Example: IDMABNDT =
                0x01: buffer size = 8 words = 32 bytes. These bits
                can only be written by firmware when DPSM is inactive
                (DPSMACT = 0).
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_IDMABASE0R</name>
          <displayName>SDMMC_IDMABASE0R</displayName>
          <description>
            The SDMMC_IDMABASE0R register contains the
            memory buffer base address in single buffer configuration
            and the buffer 0 base address in double buffer
            configuration.
          </description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDMABASE0</name>
              <description>
                Buffer 0 memory base address bits
                [31:2], shall be word aligned (bit [1:0] are always 0
                and read only). This register can be written by
                firmware when DPSM is inactive (DPSMACT = 0), and can
                dynamically be written by firmware when DPSM active
                (DPSMACT = 1) and memory buffer 0 is inactive
                (IDMABACT = 1).
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDMMC_IDMABASE1R</name>
          <displayName>SDMMC_IDMABASE1R</displayName>
          <description>
            The SDMMC_IDMABASE1R register contains the
            double buffer configuration second buffer memory base
            address.
          </description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDMABASE1</name>
              <description>
                Buffer 1 memory base address, shall be
                word aligned (bit [1:0] are always 0 and read only).
                This register can be written by firmware when DPSM is
                inactive (DPSMACT = 0), and can dynamically be
                written by firmware when DPSM active (DPSMACT = 1)
                and memory buffer 1 is inactive (IDMABACT =
                0).
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
